In [1]:
! pip install pandas
! pip install numpy

Requirement already satisfied: pandas in c:\users\diyag\onedrive\desktop\python_practice\.conda\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\diyag\onedrive\desktop\python_practice\.conda\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\diyag\onedrive\desktop\python_practice\.conda\lib\site-packages (from pandas) (2.9.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\diyag\onedrive\desktop\python_practice\.conda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\diyag\onedrive\desktop\python_practice\.conda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\diyag\onedrive\desktop\python_practice\.conda\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: numpy in c:\users\diyag\onedrive\desktop\python_practice\.conda\lib\site-packages (1.26.4)

In [2]:
import pandas as pd
import numpy as np

In [3]:
#playing with dataframes
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['col1','col2','col3','col4'])

In [4]:
df.head()

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [5]:
df.to_csv('Test1.csv')

In [7]:
# accessing elements
## 1. .loc  2. .iloc
#in loc we access row indexes and in iloc we access both row and column locations

df.loc['row1']
type(df.loc['row1'])

pandas.core.series.Series

In [12]:
type(df.iloc[0:1,0:1])

pandas.core.frame.DataFrame

In [13]:
df.iloc[0:1,0:1]

      col1
row1     0

In [14]:
#convert into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [15]:
df.iloc[:,1:].values.shape

(5, 3)

In [16]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [17]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [18]:
df['col1'].value_counts()

col1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [20]:
type(df['col1'])

pandas.core.series.Series

In [21]:
df[['col1','col2']]

      col1  col2
row1     0     1
row2     4     5
row3     8     9
row4    12    13
row5    16    17

In [25]:
df=pd.read_csv('Test1.csv')

In [23]:
df.head()

  Unnamed: 0  col1  col2  col3  col4
0       row1     0     1     2     3
1       row2     4     5     6     7
2       row3     8     9    10    11
3       row4    12    13    14    15
4       row5    16    17    18    19

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      object
 1   col1        5 non-null      int64
 2   col2        5 non-null      int64
 3   col3        5 non-null      int64
 4   col4        5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 332.0+ bytes

In [27]:
df.describe()

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [28]:
#get unique category counts
df['col1'].value_counts()

col1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [31]:
df[df['col3']>8]

  Unnamed: 0  col1  col2  col3  col4
2       row3     8     9    10    11
3       row4    12    13    14    15
4       row5    16    17    18    19